// Розгляньмо ще один приклад, коли використання узагальнених типів стає просто необхідним. Це відбувається, коли ми працюємо з асинхронним кодом. 
// Оскільки Promise може повернути абсолютно все, без дженерика ми ніколи не дізнаємось, що він повертає.
const promise: Promise<string> = new Promise((resolve) => {
    setInterval(() => {
      resolve('Done!');
    }, 1000);
  });
  
  promise.then((data) => {
    console.log(data);
  });
  
  export {};
// Всередині 'data' маємо тип 'string'. Якщо ми не вкажемо тип, він буде позначений як 'any'.