// Generic function/method

// Узагальнені функції або методи в TypeScript є способом створення функцій, що можуть працювати з різними типами даних, зберігаючи водночас типізацію вхідних і вихідних даних.
// Давайте подивимося на приклад простої узагальненої функції:
function identity<T>(arg: T): T {
    return arg;
  }

// У цій функції T є узагальненим типом. Це означає, що T є певним типом, який буде вказаний при виклику функції. Функція identity приймає аргумент типу T і повертає значення того ж типу T.
// Ми можемо викликати цю функцію для різних типів:
let output1 = identity<string>("myString"); 
let output2 = identity<number>(100);

// Також TypeScript може автоматично виводити тип під час використання узагальнених функцій, тому ми можемо опустити явну вказівку типу:
let output1 = identity("myString"); 
let output2 = identity(100);

// Як приклад, давайте розглянемо функцію, що приймає масив та повертає його перший елемент:

function firstElement<T>(arr: T[]): T {
    return arr[0];
  }
  
  let numbers = [1, 2, 3, 4, 5];
  let firstNum = firstElement(numbers);
  
  let strings = ['a', 'b', 'c', 'd'];
  let firstStr = firstElement(strings);
  
  export {};
// У цьому прикладі функція firstElement може працювати з масивами будь-яких типів і завжди повертає елемент того ж типу, що й елементи масиву.
// Тобто тип T буде замінений на number або string залежно від значень, що передаються.